wikimedia/smash-pig-backup/PaymentProviders/Adyen/Tests/Data/ipn_OrderClosed.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Body><sendNotification xmlns="http://notification.services.adyen.com"><notification><live>false</live><notificationItems><NotificationRequestItem><amount><currency xmlns="http://common.services.adyen.com">EUR</currency><value xmlns="http://common.services.adyen.com">1010</value></amount><eventCode>ORDER_CLOSED</eventCode><eventDate>2024-04-08T21:28:00+02:00</eventDate><merchantAccountCode>WikimediaDonations</merchantAccountCode><merchantReference>testMerchantRef1</merchantReference><pspReference>CRL2ZSLP6479R782</pspReference><reason></reason><success>true</success></NotificationRequestItem></notificationItems></notification></sendNotification></soap:Body></soap:Envelope>