wikimedia/smash-pig-backup/PaymentProviders/Adyen/Tests/Data/ipn_CancelAutorescue.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Body><sendNotification xmlns="http://notification.services.adyen.com"><notification><live>false</live><notificationItems><NotificationRequestItem><amount><currency xmlns="http://common.services.adyen.com">EUR</currency><value xmlns="http://common.services.adyen.com">200</value></amount><eventCode>CANCEL_AUTORESCUE</eventCode><eventDate>2024-04-08T18:40:25+02:00</eventDate><merchantAccountCode>WikimediaDonations</merchantAccountCode><merchantReference>testMerchantRef1</merchantReference><pspReference>ZT8S6WHP6479R782</pspReference><reason></reason><success>true</success></NotificationRequestItem></notificationItems></notification></sendNotification></soap:Body></soap:Envelope>
