wikimedia/smash-pig/PaymentProviders/Adyen/Tests/Data/ipn_ReportAvailable.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Body><sendNotification xmlns="http://notification.services.adyen.com"><notification><live>false</live><notificationItems><NotificationRequestItem><amount><currency xmlns="http://common.services.adyen.com">EUR</currency><value xmlns="http://common.services.adyen.com">0</value></amount><eventCode>REPORT_AVAILABLE</eventCode><eventDate>2024-04-09T14:46:33+02:00</eventDate><merchantAccountCode>YOUR_MERCHANT_ACCOUNT</merchantAccountCode><merchantReference>testMerchantRef1</merchantReference><pspReference>settlement_detail_report</pspReference><reason>URL_TO_DOWNLOAD_REPORT</reason><success>true</success></NotificationRequestItem></notificationItems></notification></sendNotification></soap:Body></soap:Envelope>